Revit 2027 API
Generic.ColorByObject Property
 The property labeled "Color By Object" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ColorByObject { get; }
Public Shared ReadOnly Property ColorByObject As String
	Get
public:
static property String^ ColorByObject {
	String^ get ();
}
static member ColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace